# ==========================================
# โจทย์ข้อที่ 3: คำนวณราคาสินค้าตามสถานะสมาชิก
# Input: บรรทัดที่ 1 ราคาสินค้าเต็ม (price), บรรทัดที่ 2 สถานะสมาชิก (is_member: 1 คือเป็นสมาชิก, 0 คือไม่เป็น)
# Output: ราคาสินค้าสุทธิ (หากเป็นสมาชิก ลดทันที 10%)
# ==========================================


# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
price = float(input("ราคาสินค้าเต็ม "))
is_member = int(input("สถานะสมาชิก(1 คือเป็นสมาชิก, 0 คือไม่เป็น) "))               
discount = price *10/100
net_price = price - discount
if is_member == 1 :
    print(f"ราคาสินค้าสุทธิ {net_price}")
else :
    print(f"ราคาสินค้าสุทธิ {price}")
